##### ATPA 2.3 - Data Transformation and Cleaning

###### Formatting Dates in Python https://stackabuse.com/how-to-format-dates-in-python/

In [2]:
# CHUNK 1: Create the data frame

import pandas as pd
import numpy as np

trials = pd.DataFrame({"Phase":["A","A","A","B","B","B","C","C","C"],
                        "Count":[50,40,65,70,70,90,30,20,25],
                        "Successes":[20,17,31,40,33,41,12,9,9],
                        "Location":["Austin Texas","Nashville Tennessee","Nashville Tennessee","Dallas Texas","Seattle Washington","Houston Texas","Orlando Florida","Cincinnati Ohio","El Paso Texas"]})
trials

  Phase  Count  Successes             Location
0     A     50         20         Austin Texas
1     A     40         17  Nashville Tennessee
2     A     65         31  Nashville Tennessee
3     B     70         40         Dallas Texas
4     B     70         33   Seattle Washington
5     B     90         41        Houston Texas
6     C     30         12      Orlando Florida
7     C     20          9      Cincinnati Ohio
8     C     25          9        El Paso Texas

In [2]:
# CHUNK 2: Subset to select Phase = A

# Subset to only Phase A
trials_A = trials.query("Phase == 'A' and Successes >= 20")
# trials_A = trials.query("Phase == 'A'")
display(trials_A)

# CHUNK 2A: Subsetting using brackets

trials_A = trials.loc[trials.Phase == "A",:]
trials_A

  Phase  Count  Successes             Location
0     A     50         20         Austin Texas
2     A     65         31  Nashville Tennessee

  Phase  Count  Successes             Location
0     A     50         20         Austin Texas
1     A     40         17  Nashville Tennessee
2     A     65         31  Nashville Tennessee

In [ ]:
# CHUNK 3: Subset to select Phase = A or B

# Either Phase A or B
trials_ABv1 = trials.query("Phase in ['A','B']") # or
trials_ABv2 = trials.query("Phase == 'A' or Phase == 'B'")
trials_ABv1
trials_ABv2

In [ ]:
# CHUNK 4: Subset to select Phase not equal to A

# Not Phase A
trials_NotAv1 = trials.query("Phase != 'A'") # or
trials_NotAv2 = trials.query("not Phase == 'A'")
trials_NotAv1
trials_NotAv2

In [19]:
# CHUNK 5: Exercise 2.3.1: Use three different ways to subset to all locations where Phase is A or C
display(trials.query("Phase == ['A', 'B']"))
display(trials.loc[(trials.Phase == 'A') | (trials.Phase == 'B')])
display(trials.query("Phase != 'C'"))

  Phase  Count  Successes             Location
0     A     50         20         Austin Texas
1     A     40         17  Nashville Tennessee
2     A     65         31  Nashville Tennessee
3     B     70         40         Dallas Texas
4     B     70         33   Seattle Washington
5     B     90         41        Houston Texas

  Phase  Count  Successes             Location
0     A     50         20         Austin Texas
1     A     40         17  Nashville Tennessee
2     A     65         31  Nashville Tennessee
3     B     70         40         Dallas Texas
4     B     70         33   Seattle Washington
5     B     90         41        Houston Texas

  Phase  Count  Successes             Location
0     A     50         20         Austin Texas
1     A     40         17  Nashville Tennessee
2     A     65         31  Nashville Tennessee
3     B     70         40         Dallas Texas
4     B     70         33   Seattle Washington
5     B     90         41        Houston Texas

In [ ]:
# CHUNK 6: Exercise 2.3.1: Solution

sol1 = trials.query("Phase in ['A','C']") 
sol2 = trials.query("Phase == 'A' or Phase == 'C'") 
sol3 = trials.query("Phase != 'B'") 
sol1
sol2
sol3

In [ ]:
# CHUNK 7: Subset to Counts greater than or equal to 50

# Count greater than or equal to 50
trials_50 = trials.query("Count >= 50")
trials_50

In [ ]:
# CHUNK 8: Subset to Count less than 40 or greater than 70

# Count less than 40 or greater than 70
trials_4070 = trials.query("Count < 40 or Count > 70")
trials_4070

In [ ]:
# CHUNK 9: Subset to Count between 45 and 80

# Count between 45 and 80
trials_4580 = trials.query("Count > 45 and Count < 80")
trials_4580

In [22]:
trials.Location.str.contains('Texas')

0     True
1    False
2    False
3     True
4    False
5     True
6    False
7    False
8     True
Name: Location, dtype: bool

In [26]:
# CHUNK 10: Subset to Location contains Texas

# Location contains Texas
trials_Texas = trials.loc[trials.Location.str.contains('Texas'),:]
trials_Texas

trials.loc[trials.Location.str.startswith('Texas'),:]
trials.loc[trials.Location.str.endswith('Texas'),:]
trials.loc[trials.Location.str.isdigit(),:]

Empty DataFrame
Columns: [Phase, Count, Successes, Location]
Index: []

In [ ]:
# CHUNK 12: Exercise 2.3.2: Solution

# Subset to locations that
# a) contain "n"
trials_contain_n = trials.loc[trials.Location.str.contains('n'),:]
trials_contain_n

# b) ends with "n"
trials_end_n = trials.loc[trials.Location.str.endswith('n'),:]
trials_end_n

# c) start with "n"
trials_start_n = trials.loc[trials.Location.str.startswith('n'),:]
trials_start_n

In [ ]:
# CHUNK 13: Subset to Phase is A and Count exceeds 40

# Phase is A and count is more than 40
trials_A40 = trials.query("Phase == 'A' and Count > 40")
trials_A40

In [ ]:
# CHUNK 15: Exercise 2.3.3: Solution


# Subset to observations where Count is less than 50 AND Successes are more than 15.
trials_50and15 = trials.query("Count < 50 and Successes > 15")
trials_50and15

# Subset to observations where either Count is less than 50 OR Successes are more than 15.
trials_50or15 = trials.query("Count < 50 or Successes > 15")
trials_50or15

In [30]:
# CHUNK 16: Exercise 2.3.4: Subset to include only locations that include an “s” AND have more than 10 successes
trials.loc[trials.Location.str.contains('n') & (trials.Successes > 10), :]

  Phase  Count  Successes             Location
0     A     50         20         Austin Texas
1     A     40         17  Nashville Tennessee
2     A     65         31  Nashville Tennessee
4     B     70         33   Seattle Washington
5     B     90         41        Houston Texas
6     C     30         12      Orlando Florida

In [28]:
# CHUNK 17: Exercise 2.3.4: Solution
trials_sand10 = trials.loc[trials.Location.str.contains('n') & (trials.Successes > 10),:]
trials_sand10

  Phase  Count  Successes             Location
0     A     50         20         Austin Texas
1     A     40         17  Nashville Tennessee
2     A     65         31  Nashville Tennessee
4     B     70         33   Seattle Washington
5     B     90         41        Houston Texas
6     C     30         12      Orlando Florida

In [ ]:
# CHUNK 18: Subset to the Count variable

# Subset to the Count variable
trials_Count = trials.loc[:,"Count"]
trials_Count

In [ ]:
# CHUNK 19: Subset to the Count and Successes variables

# Subset to counts and successes
trials_CandSv1 = trials.loc[:,["Count","Successes"]] # or
trials_CandSv2 = trials.iloc[:,1:3]
trials_CandSv1
trials_CandSv2

In [ ]:
# CHUNK 20: Subset to delete the variable Location

# Subset to all variables except Location
trials_noLocation = trials.drop(columns = ["Location"])
trials_noLocation

In [ ]:
# CHUNK 21: Exercise 2.3.5: Subset to include Count and Successes for those in Phase A

In [ ]:
# CHUNK 22: Exercise 2.3.5: Solution

sol = trials.query("Phase == 'A'") # Must do this first, before deleting the Phase column
sol = sol.loc[:,["Count","Successes"]]
sol

In [3]:
# CHUNK 23: Order the data by increasing count

# Sort by Count, low to high
trials_sortCountInc = trials.sort_values(["Count"])
trials_sortCountInc

  Phase  Count  Successes             Location
7     C     20          9      Cincinnati Ohio
8     C     25          9        El Paso Texas
6     C     30         12      Orlando Florida
1     A     40         17  Nashville Tennessee
0     A     50         20         Austin Texas
2     A     65         31  Nashville Tennessee
3     B     70         40         Dallas Texas
4     B     70         33   Seattle Washington
5     B     90         41        Houston Texas

In [ ]:
# CHUNK 24: Order the data by decreasing count

# Sort counts high to low
trials_sortCountDec = trials.sort_values(["Count"],ascending =False)
trials_sortCountDec

In [5]:
# CHUNK 25: Order the data by increasing count, using increasing successes to break ties

# Successes is a tie breaker for counts
trials_tiebreak1 = trials.sort_values(["Count","Successes"])
display(trials_tiebreak1)

# The following breaks the tie using decreasing successes
trials_tiebreak2 = trials.sort_values(["Count","Successes"], ascending = [True, False])
trials_tiebreak2

  Phase  Count  Successes             Location
7     C     20          9      Cincinnati Ohio
8     C     25          9        El Paso Texas
6     C     30         12      Orlando Florida
1     A     40         17  Nashville Tennessee
0     A     50         20         Austin Texas
2     A     65         31  Nashville Tennessee
4     B     70         33   Seattle Washington
3     B     70         40         Dallas Texas
5     B     90         41        Houston Texas

  Phase  Count  Successes             Location
7     C     20          9      Cincinnati Ohio
8     C     25          9        El Paso Texas
6     C     30         12      Orlando Florida
1     A     40         17  Nashville Tennessee
0     A     50         20         Austin Texas
2     A     65         31  Nashville Tennessee
3     B     70         40         Dallas Texas
4     B     70         33   Seattle Washington
5     B     90         41        Houston Texas

In [39]:
trials = trials.assign(zeros = np.zeros(len(trials.index)))
display(trials)
trials.drop(columns=["zeros"], inplace=True)
display(trials)

  Phase  Count  Successes             Location  zeros
0     A     50         20         Austin Texas    0.0
1     A     40         17  Nashville Tennessee    0.0
2     A     65         31  Nashville Tennessee    0.0
3     B     70         40         Dallas Texas    0.0
4     B     70         33   Seattle Washington    0.0
5     B     90         41        Houston Texas    0.0
6     C     30         12      Orlando Florida    0.0
7     C     20          9      Cincinnati Ohio    0.0
8     C     25          9        El Paso Texas    0.0

  Phase  Count  Successes             Location
0     A     50         20         Austin Texas
1     A     40         17  Nashville Tennessee
2     A     65         31  Nashville Tennessee
3     B     70         40         Dallas Texas
4     B     70         33   Seattle Washington
5     B     90         41        Houston Texas
6     C     30         12      Orlando Florida
7     C     20          9      Cincinnati Ohio
8     C     25          9        El Paso Texas

In [ ]:
# CHUNK 26: Create the new variable Rate = Successes/Count

# Create a new variable
trials_rate1 = trials.assign(Rate = trials.Successes/trials.Count)
trials_rate1
trials_rate2 = trials.copy() # Ensures that an exact copy is made, which ignores the internal cration of Rate above.
trials_rate2["Rate"] = trials_rate2.Successes/trials.Count
trials_rate2

In [ ]:
# CHUNK 27: Creating two variables at once

# Create multiple variables
trials_multi = trials.assign(Large_Counts = trials.Count > 50, In_Texas = trials.Location.str.contains("Texas"))
trials_multi

In [42]:
# CHUNK 28: Create bins for the Count variable

# Create binned variable
trials_bin = trials.assign(Count_Level = pd.cut(trials.Count,bins = [0,35,65,100],labels = ["Low","Medium","High"]))
trials_bin

  Phase  Count  Successes             Location Count_Level
0     A     50         20         Austin Texas      Medium
1     A     40         17  Nashville Tennessee      Medium
2     A     65         31  Nashville Tennessee      Medium
3     B     70         40         Dallas Texas        High
4     B     70         33   Seattle Washington        High
5     B     90         41        Houston Texas         NaN
6     C     30         12      Orlando Florida         Low
7     C     20          9      Cincinnati Ohio         Low
8     C     25          9        El Paso Texas         Low

In [ ]:
# CHUNK 29: Overwrite Location by making each observation have the value "Unknown"

# Reassign an existing variable
trials_unknown = trials.assign(Location = "Unknown")
trials_unknown

In [48]:
# CHUNK 30: Exercise 2.3.6: Create two sets of bins for the Successes variable

# (a) Bin Successes using cutoffs of 15 and 30
display(trials.assign(manual_Cutoffs = pd.cut(trials.Count, bins = [0,15,30,100], labels = ['Low', 'Medium', 'High'])).sort_values(['Count']))

# (b) Bin Successes into four bins with an approximately equal number of observations in each bin. Check help on cut.
trials.assign(auto_Cutoffs = pd.cut(trials.Count, bins=4, labels = ['Low', 'Medium', 'High', 'Mega'])).sort_values(['Count'])

  Phase  Count  Successes             Location manual_Cutoffs
7     C     20          9      Cincinnati Ohio         Medium
8     C     25          9        El Paso Texas         Medium
6     C     30         12      Orlando Florida         Medium
1     A     40         17  Nashville Tennessee           High
0     A     50         20         Austin Texas           High
2     A     65         31  Nashville Tennessee           High
3     B     70         40         Dallas Texas           High
4     B     70         33   Seattle Washington           High
5     B     90         41        Houston Texas           High

  Phase  Count  Successes             Location auto_Cutoffs
7     C     20          9      Cincinnati Ohio          Low
8     C     25          9        El Paso Texas          Low
6     C     30         12      Orlando Florida          Low
1     A     40         17  Nashville Tennessee       Medium
0     A     50         20         Austin Texas       Medium
2     A     65         31  Nashville Tennessee         High
3     B     70         40         Dallas Texas         High
4     B     70         33   Seattle Washington         High
5     B     90         41        Houston Texas         Mega

In [ ]:
# CHUNK 31: Exercise 2.3.6: Solution

# (a) Bin Successes using cutoffs of 15 and 30
trials_bin1 = trials.assign(Success_Level = pd.cut(trials.Successes,bins = [0,15,30,100],labels = ["Low","Medium","High"]))
trials_bin1

# (b) Bin Successes into four bins with an approximately equal number of observations in each bin.
trials_bin2 = trials.assign(Success_Level = pd.cut(trials.Successes,bins = 4))  # By not specifying the labels, they will be generated automatically. See help to learn why the lower limit of the first interval was changed.
trials_bin2

In [51]:
# CHUNK 32: Obtain the mean count by phase

# Find mean counts by phase
# In Python, this can be done simply, as follows:
trials_means = trials.groupby("Phase").agg({"Count":"mean"})
trials_means
# The following code puts Phase (in this case) as a variable, not a row label. It also changes the name of the aggregated variable
trials_means2 = trials.groupby("Phase",as_index=False).agg({"Count":"mean"}).rename(columns={"Count":"Mean_Count"})
trials_means2

  Phase  Mean_Count
0     A   51.666667
1     B   76.666667
2     C   25.000000

In [57]:
# CHUNK 33: Obtain the number of observations in each phase

# Counts how many in each phase
trials_number = trials.groupby("Phase",as_index=False).size().rename(columns={"size":"Number_in_Phase"})
trials_number

  Phase  Number_in_Phase
0     A                3
1     B                3
2     C                3

In [ ]:
# CHUNK 34: Obtain the number of unique locations in each phase

# Count the number of unique locations in each phase
trials_unique = trials.groupby("Phase",as_index=False).agg({"Location":"nunique"}).rename(columns={"Location":"Unique_Locations"})
trials_unique

In [58]:
# CHUNK 35: Exercise 2.3.7: Obtain the number of unique values of Count in each Phase

# Count the number of unique Count values there are in each Phase.
trials.groupby(["Phase"], as_index=False).agg({'Count':'nunique'}).rename(columns={'Count':'Uniq_Count'})

  Phase  Uniq_Count
0     A           3
1     B           2
2     C           3

In [ ]:
# CHUNK 36: Exercise 2.3.7: Solution

# Count the number of unique Count values there are in each Phase.
trials_countOfCount = trials.groupby("Phase",as_index=False).agg({"Count":"nunique"}).rename(columns={"Count":"Unique_Counts"})
trials_countOfCount

In [ ]:
# CHUNK 37: Exercise 2.3.8: 

flights = pd.read_csv("Data/flights.csv")
# pd.set_option('max_columns', None) # This will display all the columns

# 1. Filter observations to only values where carrier is equal to “UA”
flights.query("carrier == 'UA'")
# 2. Filter observations to only where the dest variable is either “MIA” or “ORD”
flights.query("dest == 'MIA' or dest == 'ORD'")
# 3. Filter observations to only where air_time is between 60 and 120 minutes.
flights.query("air_time >= 60 and air_time <= 120")
# 4. Filter variables to only sched_dep_time and dep_delay
flights.filter(['sched_dep_time', 'dep_delay'])
# 5. Order the data from longest distance to shortest distance
flights.sort_values(['distance'], ascending=False)
# 6. Create a new variable called delayed that returns TRUE if dep_delay is greater than 0 and FALSE otherwise.
flights.assign(delayed = pd.cut(flights.dep_delay, bins=[-float("inf"), 0, float("inf")], labels=[False, True]))
# 7. Create a new variable called mph that is equal to distance divided by air_time times 60
flights.assign(mph = flights.distance/flights.air_time*60.)
# 8. Determine mean dep_delay values by carrier. Call it mean_delay
flights.groupby(['carrier'], as_index=False).agg({'dep_delay':'mean'}).rename(columns={'dep_delay':'mean_delay'}).sort_values(['carrier'])
# 9. Each plane has a unique value for tailnum. Determine how many distinct planes each carrier uses. Call it num_planes
flights.groupby(['carrier'], as_index=False).agg({'tailnum':'nunique'}).rename(columns={'tailnum':'numplanes'})

In [ ]:
# CHUNK 38: Exercise 2.3.8: Solution

flights = pd.read_csv("flights.csv")
pd.set_option('max_columns', None) # This will display all the columns

# 1. Filter observations to only values where carrier is equal to “UA”
flights.query("carrier == 'UA'")

# 2. Filter observations to only where the dest variable is either “MIA” or “ORD”
flights.query("dest in ['MIA','ORD']")

# 3. Filter observations to only where air_time is between 60 and 120 minutes.
flights.query("air_time > 60 and air_time < 120")

# 4. Filter variables to only sched_dep_time and dep_delay
flights.loc[:,["sched_dep_time","dep_delay"]]

# 5. Order the data from longest distance to shortest distance
flights.sort_values("distance",ascending=False)

# 6. Create a new variable called delayed that returns TRUE if dep_delay is greater than 0 and FALSE otherwise.
flights.assign(delayed = flights.dep_delay > 0)

# 7. Create a new variable called mph that is equal to distance divided by air_time times 60
flights.assign(mph = flights.distance/flights.air_time*60.)

# 8. Determine mean dep_delay values by carrier. Call it mean_delay
flights.groupby("carrier",as_index=False).agg({"dep_delay":"mean"}).rename(columns={"dep_delay":"mean_delay"})

# 9. Each plane has a unique value for tailnum. Determine how many distinct planes each carrier uses. Call it num_planes
flights.groupby("carrier",as_index=False).agg({"tailnum":"nunique"}).rename(columns={"tailnum":"num_planes"})

In [82]:
display(flights)

,year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,carrier,flight,tailnum,origin,dest,air_time,distance,hour,minute,time_hour,Date
0,2013,1,1,517.0,515,2.0,830.0,819,11.0,UA,1545,N14228,EWR,IAH,227.0,1400,5,15,2013-01-01 05:00:00,2013-01-01
1,2013,1,1,533.0,529,4.0,850.0,830,20.0,UA,1714,N24211,LGA,IAH,227.0,1416,5,29,2013-01-01 05:00:00,2013-01-01
2,2013,1,1,542.0,540,2.0,923.0,850,33.0,AA,1141,N619AA,JFK,MIA,160.0,1089,5,40,2013-01-01 05:00:00,2013-01-01
3,2013,1,1,544.0,545,-1.0,1004.0,1022,-18.0,B6,725,N804JB,JFK,BQN,183.0,1576,5,45,2013-01-01 05:00:00,2013-01-01
4,2013,1,1,554.0,600,-6.0,812.0,837,-25.0,DL,461,N668DN,LGA,ATL,116.0,762,6,0,2013-01-01 06:00:00,2013-01-01
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
336771,2013,9,30,NaN,1455,NaN,NaN,1634,NaN,9E,3393,NaN,JFK,DCA,NaN,213,14,55,2013-09-30 14:00:00,2013-09-30
336772,2013,9,30,NaN,2200,NaN,NaN,2312,NaN,9E,3525,NaN,LGA,SYR,NaN,198,22,0,2013-09-30 22:00:00,2013-09-30
336773,2013,9,30,NaN,1210,NaN,NaN,1330,NaN,MQ,3461,N535MQ,LGA,BNA,NaN,764,12,10,2013-09-30 12:00:00,2013-09-30
336774,2013,9,30,NaN,1159,NaN,NaN,1344,NaN,MQ,3572,N511MQ,LGA,CLE,NaN,419,11,59,2013-09-30 11:00:00,2013-09-30
336775,2013,9,30,NaN,840,NaN,NaN,1020,NaN,MQ,3531,N839MQ,LGA,RDU,NaN,431,8,40,2013-09-30 08:00:00,2013-09-30

In [112]:
# CHUNK 39: Exercise 2.3.9

# Determine the top 5 most common destinations from JFK airport.
flights.loc[flights.origin == "JFK",:] \
    .groupby(['dest'], as_index=False) \
    .size() \
    .rename(columns={'size':'number_flights'}) \
    .sort_values(['number_flights'], ascending=False).head(5)

   dest  number_flights
31  LAX           11262
60  SFO            8204
6   BOS            5898
34  MCO            5464
62  SJU            4752

In [ ]:

# CHUNK 40: Exercise 2.3.9: Solution

# Determine the top 5 most common destinations from JFK airport.
flights_jfk = flights.query("origin == 'JFK'").groupby("dest",as_index=False).size().rename(columns={"size":"number_flights"}).sort_values("number_flights",ascending=False)
flights_jfk.head(5)

In [18]:
# CHUNK 41: Exercise 2.3.10

# Create a new variable that is the total number of nights booked by adding stay_in_weekday_nights and stay_in_weekend_nights. Keep only bookings where the reserved_room_type and the assigned_room_type are equal. Find the mean number of total nights stayed grouped by assigned_room_type.
hotel = pd.read_csv("Data/hotel_bookings.csv")
# display(hotel.head(2))
# print(hotel.columns)

hotel.assign(total_nights = hotel.stays_in_weekend_nights + hotel.stays_in_week_nights) \
    .query("reserved_room_type == assigned_room_type") \
    .groupby("assigned_room_type", as_index = False) \
    .agg({'total_nights':'mean'}) \
    .rename(columns = {'total_nights':'average_total_nights'})

  assigned_room_type  average_total_nights
0                  A              3.203538
1                  B              3.379555
2                  C              4.737259
3                  D              4.215325
4                  E              4.833868
5                  F              3.727743
6                  G              4.321411
7                  H              4.085616
8                  L              1.000000
9                  P              1.250000

In [17]:
# CHUNK 42: Exercise 2.3.10: Solution

# Create a new variable that is the total number of nights booked by adding stay_in_weekday_nights and stay_in_weekend_nights. Keep only bookings where the reserved_room_type and the assigned_room_type are equal. Find the mean number of total nights stayed grouped by assigned_room_type.

hotel_bookings = pd.read_csv("Data/hotel_bookings.csv")

hotel_bookings.assign(total_stay = hotel_bookings.stays_in_week_nights + hotel_bookings.stays_in_weekend_nights).query("assigned_room_type == reserved_room_type").groupby("assigned_room_type",as_index=False).agg({"total_stay":"mean"}).rename(columns={"total_stay":"average_total_stay"})

  assigned_room_type  average_total_stay
0                  A            3.203538
1                  B            3.379555
2                  C            4.737259
3                  D            4.215325
4                  E            4.833868
5                  F            3.727743
6                  G            4.321411
7                  H            4.085616
8                  L            1.000000
9                  P            1.250000

In [19]:

# CHUNK 43: Create and display the sample data

import numpy as np
security = pd.DataFrame({"Camera":["Lobby","Main Floor","Back Door","Front Door","Offices"],"Total Hours Recorded":[51,59,-1,22,27],"Incidents":[2,1,0,0,np.nan]})

security

       Camera  Total Hours Recorded  Incidents
0       Lobby                    51        2.0
1  Main Floor                    59        1.0
2   Back Door                    -1        0.0
3  Front Door                    22        0.0
4     Offices                    27        NaN

In [20]:

# CHUNK 44: Rename Total Hours Recorded to Hours_Recorded

# Renaming variables
security = security.rename(columns = {"Total Hours Recorded":"Hours_Recorded"})
security

       Camera  Hours_Recorded  Incidents
0       Lobby              51        2.0
1  Main Floor              59        1.0
2   Back Door              -1        0.0
3  Front Door              22        0.0
4     Offices              27        NaN

In [21]:
# CHUNK 45: Remove observations with Hours_Recorded = -1 or Incidents = NaN

# Remove missing values specifically for each row
security.dropna(subset=["Incidents"]).query("Hours_Recorded != -1") # This time we are not saving the output as we may decide on a different way to deal with missing values.

       Camera  Hours_Recorded  Incidents
0       Lobby              51        2.0
1  Main Floor              59        1.0
3  Front Door              22        0.0

In [22]:
# CHUNK 46: Remove observations with NaNs without filtering

# Remove all instances of NaN
security.dropna()

       Camera  Hours_Recorded  Incidents
0       Lobby              51        2.0
1  Main Floor              59        1.0
2   Back Door              -1        0.0
3  Front Door              22        0.0

In [23]:
# CHUNK 47: Change all instances of -1 to NaN

# # CHUNK 5
# Recode all instances of missing to NA
# Because this code makes a permanent change to the data, we do it with a new version
security_recode = security.replace(-1,np.nan)
security_recode
del security_recode # removes the object

In [31]:
# CHUNK 48: Exercise 2.3.11: Remove observations with 0 -1, and NA as if they are all missing values. Rename Incidents to Occurrences
display(security)

security.replace([-1., 0., 'NA'], np.nan).dropna() \
    .rename(columns = {'Incidents':'Occurrences'})

       Camera  Hours_Recorded  Incidents
0       Lobby              51        2.0
1  Main Floor              59        1.0
2   Back Door              -1        0.0
3  Front Door              22        0.0
4     Offices              27        NaN

       Camera  Hours_Recorded  Occurrences
0       Lobby            51.0          2.0
1  Main Floor            59.0          1.0

In [29]:
# CHUNK 49: Exercise 2.3.11: Solution

# Remove observations with 0 -1, and NA as if they are all missing values. Rename Incidents to Occurrences
security_drop = security.dropna(subset=["Incidents"]).query("Hours_Recorded != -1 & Incidents != 0")
security_drop = security_drop.rename(columns = {"Incidents":"Occurrences"})
security_drop

       Camera  Hours_Recorded  Occurrences
0       Lobby              51          2.0
1  Main Floor              59          1.0

In [32]:
# CHUNK 50: String to Numeric

# String to Numeric
x="3"; y="4"
int(x)+int(y)

7

In [33]:
# CHUNK 51: Numeric to String

# Numeric to String
str(3)

'3'

In [34]:
# CHUNK 52: Changing case

# Case
"String".lower() # string
"String".upper() # STRING

'STRING'

In [35]:
# CHUNK 53: Working with a vector of strings

X = ["String1", "String2"]
[str.lower() for str in X]
[str.upper() for str in X]

['STRING1', 'STRING2']

In [38]:
# CHUNK 54: Replacing string content

# Replacement
x = "my_string"
x.replace("my","your")
X = ["my_string1","my_string2"]
[str.replace("my","your") for str in X]
# X.replace("my", "your") # error

AttributeError: 'list' object has no attribute 'replace'

In [39]:
# CHUNK 55: Replacing string content

# Converting money to numeric
x = "$84,510"
float(x.replace("$","").replace(",","")) # 84510

84510.0

In [40]:
# CHUNK 56: Obtaining substrings

# Substrings
x = "apple"
x[0:3]
X = ["apple","pear"]
[str[0:3] for str in X]

['app', 'pea']

In [41]:
# CHUNK 57: Combining and splitting strings

# Combining Strings
"apple"+"crisp"
"".join(["honey","apple","crisp"]) # no space between the words
"-".join(["honey","apple","crisp"]) # places a dash between the words
# honey-apple-crisp
" ".join(["honey","apple","crisp"]) # places a space between the words
# honey apple crisp

# Splitting Strings
dessert = "honey apple crisp"
dessert.split(" ")

['honey', 'apple', 'crisp']

In [47]:
# CHUNK 58: Exercise 2.3.12: Perform the indicated tasks on a vector of words

my_words = ["Actuarial","Exam","Passed"]

# 1. Change all the letters to lower case
[word.lower() for word in my_words]

# 2. Replace each letter “a” with a dollar sign, “$”
[word.replace("a", "$") for word in my_words]

# 3. Combine all three words putting a space in between
" ".join(my_words)

'Actuarial Exam Passed'

In [48]:
# CHUNK 59: Exercise 2.3.12: Solution

my_words = ["Actuarial","Exam","Passed"]

# 1. Change all the letter to lower case
[str.lower() for str in my_words]

# 2. Replace all “a”’s with dollar signs, “$”
[str.replace("a","$") for str in my_words]

# 3. Combine all three words putting a space in between
" ".join(my_words)

'Actuarial Exam Passed'

In [49]:
# CHUNK 60: Making date variables

# The datetime package comes with python and does not need to be installed
import datetime as dt
dt.date(year = 2022, month = 1, day=1)
dt.datetime(year = 2022, month =1, day = 1, hour = 9, minute = 30, second = 55)

datetime.datetime(2022, 1, 1, 9, 30, 55)

In [50]:
# CHUNK 61: Converting string to date

Date1 = "10/01/2021"
Date2 = "20211001"
dt.datetime.strptime(Date1, "%m/%d/%Y")
dt.datetime.strptime(Date2, "%Y%m%d")
Date_Time = "10-01-2021 5:30:41"
dt.datetime.strptime(Date_Time, "%m-%d-%Y %H:%M:%S")

datetime.datetime(2021, 10, 1, 5, 30, 41)

In [51]:

# CHUNK 62: Calculating time differences

# Time differences
dt.date.today() - dt.date(2021,1,1)
dt.datetime.now() - dt.datetime(2021,1,1,9,30,55)
Time1 = dt.datetime.strptime("12:30:09","%H:%M:%S")
Time2 =dt.datetime.strptime("12:35:30","%H:%M:%S")
Time2 - Time1

datetime.timedelta(seconds=321)

In [52]:
# CHUNK 63: Extract day/month/year from a date variable

my_date = dt.datetime.strptime("07102003", "%m%d%Y")
my_date.strftime("%m") # Extracts the month as a number
my_date.strftime("%B") # Extracts the name of the month
my_date.strftime("%Y") # Extracts the year
my_date.strftime("%d") # Extracts the day of the month
my_date.strftime("%w") # Extracts the day of the week as a number, Sunday is 0
my_date.strftime("%A") # Extracts the day of week as a name

'Thursday'

In [55]:
my_date.strftime("%m-%d-%Y")

'07-10-2003'

0          1-1-2013
1          1-1-2013
2          1-1-2013
3          1-1-2013
4          1-1-2013
            ...
336771    9-30-2013
336772    9-30-2013
336773    9-30-2013
336774    9-30-2013
336775    9-30-2013
Length: 336776, dtype: object

In [75]:
# CHUNK 64: Exercise 2.3.13: Convert the Year, Month, and Day variables in the flight data to a single date variable

# Reload the flights data if needed
flights = pd.read_csv("Data/flights.csv")

cols = ['month', 'day', 'year']
Date = flights[cols].apply(lambda row: "-".join(row.values.astype(str)), axis=1)
flights['Date'] = [dt.datetime.strptime(i, "%m-%d-%Y") for i in Date]
flights.head()

,year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,carrier,flight,tailnum,origin,dest,air_time,distance,hour,minute,time_hour,Date
0,2013,1,1,517.0,515,2.0,830.0,819,11.0,UA,1545,N14228,EWR,IAH,227.0,1400,5,15,2013-01-01 05:00:00,2013-01-01
1,2013,1,1,533.0,529,4.0,850.0,830,20.0,UA,1714,N24211,LGA,IAH,227.0,1416,5,29,2013-01-01 05:00:00,2013-01-01
2,2013,1,1,542.0,540,2.0,923.0,850,33.0,AA,1141,N619AA,JFK,MIA,160.0,1089,5,40,2013-01-01 05:00:00,2013-01-01
3,2013,1,1,544.0,545,-1.0,1004.0,1022,-18.0,B6,725,N804JB,JFK,BQN,183.0,1576,5,45,2013-01-01 05:00:00,2013-01-01
4,2013,1,1,554.0,600,-6.0,812.0,837,-25.0,DL,461,N668DN,LGA,ATL,116.0,762,6,0,2013-01-01 06:00:00,2013-01-01

In [76]:
# CHUNK 65: Exercise 2.3.13: Solution

# Reload the flights data if needed
# flights = pd.read_csv("flights.csv")
# flights.assign(Date = dt.date(year = flights.year, month = flights.month, day = flights.day)) # This seems logical but doesn't work. R can work with vectors, so a command like this can process all the rows at once. Python can only do one row at a time and so a loop is needed here.

Date = [dt.date(year = flights.year[i], month = flights.month[i], day = flights.day[i]) for i in range(flights.shape[0])]
flights["Date"] = Date
del Date
flights

,year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,carrier,flight,tailnum,origin,dest,air_time,distance,hour,minute,time_hour,Date
0,2013,1,1,517.0,515,2.0,830.0,819,11.0,UA,1545,N14228,EWR,IAH,227.0,1400,5,15,2013-01-01 05:00:00,2013-01-01
1,2013,1,1,533.0,529,4.0,850.0,830,20.0,UA,1714,N24211,LGA,IAH,227.0,1416,5,29,2013-01-01 05:00:00,2013-01-01
2,2013,1,1,542.0,540,2.0,923.0,850,33.0,AA,1141,N619AA,JFK,MIA,160.0,1089,5,40,2013-01-01 05:00:00,2013-01-01
3,2013,1,1,544.0,545,-1.0,1004.0,1022,-18.0,B6,725,N804JB,JFK,BQN,183.0,1576,5,45,2013-01-01 05:00:00,2013-01-01
4,2013,1,1,554.0,600,-6.0,812.0,837,-25.0,DL,461,N668DN,LGA,ATL,116.0,762,6,0,2013-01-01 06:00:00,2013-01-01
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
336771,2013,9,30,NaN,1455,NaN,NaN,1634,NaN,9E,3393,NaN,JFK,DCA,NaN,213,14,55,2013-09-30 14:00:00,2013-09-30
336772,2013,9,30,NaN,2200,NaN,NaN,2312,NaN,9E,3525,NaN,LGA,SYR,NaN,198,22,0,2013-09-30 22:00:00,2013-09-30
336773,2013,9,30,NaN,1210,NaN,NaN,1330,NaN,MQ,3461,N535MQ,LGA,BNA,NaN,764,12,10,2013-09-30 12:00:00,2013-09-30
336774,2013,9,30,NaN,1159,NaN,NaN,1344,NaN,MQ,3572,N511MQ,LGA,CLE,NaN,419,11,59,2013-09-30 11:00:00,2013-09-30
336775,2013,9,30,NaN,840,NaN,NaN,1020,NaN,MQ,3531,N839MQ,LGA,RDU,NaN,431,8,40,2013-09-30 08:00:00,2013-09-30

In [80]:

# CHUNK 66: Create ordered and unordered factor variables

# Create an ordered factor variable
fct_ordered = pd.Categorical(["good","good","poor","okay"],ordered=True,categories=["poor","okay","good"])
fct_ordered

# Create an unordered factor variable
fct_unordered = pd.Categorical(["good","good","poor","okay"],ordered=False)
fct_unordered

# Convert an ordered factor variable to unordered
fct_unordered_2 = pd.Categorical(fct_unordered,ordered=False)
fct_unordered_2

['good', 'good', 'poor', 'okay']
Categories (3, object): ['good', 'okay', 'poor']

In [91]:
# CHUNK 67: Factor recoding and combining

# Survey data set
survey = pd.DataFrame({"Individual":[1,2,3,4,5],"Sex":pd.Categorical(["Male","male","fem.","Female","M"]),"Answer": pd.Categorical(["Y","Y","N","Yes","n"])})
survey

   Individual     Sex Answer
0           1    Male      Y
1           2    male      Y
2           3    fem.      N
3           4  Female    Yes
4           5       M      n

In [92]:
# CHUNK 68: Change factors to upper case

# Recoding
survey.assign(Sex = survey.Sex.str.upper(),Answer = survey.Answer.str.upper())

   Individual     Sex Answer
0           1    MALE      Y
1           2    MALE      Y
2           3    FEM.      N
3           4  FEMALE    YES
4           5       M      N

In [93]:
# CHUNK 69: Change factors to upper case and retain only first letter

survey_one = survey.assign(Sex = pd.Categorical(survey.Sex.str.upper().str[0]),Answer = pd.Categorical(survey.Answer.str.upper().str[0]))
survey_one
survey_one["Sex"].cat.categories
survey_one["Answer"].cat.categories

Index(['N', 'Y'], dtype='object')

In [97]:
# CHUNK 70: Change factor values with direct recoding

# Recoding directly
survey_direct = survey.copy()
survey_direct["Sex"] = pd.Categorical(survey_direct["Sex"].map({"M":"Male","male":"Male","fem.":"Female","Male":"Male","Female":"Female"}))
survey_direct["Sex"].cat.categories

Index(['Female', 'Male'], dtype='object')

In [98]:
# CHUNK 71: Combining factors

# Factor combining
small_levels = {"AS","F9","HA","OO","YV"}
mask = flights.carrier.isin(small_levels)
flights_comb = flights
flights_comb.carrier[mask] = "Other"
flights_comb.carrier = pd.Categorical(flights_comb.carrier)
flights_comb["carrier"].cat.categories
flights_comb.carrier.value_counts()

/tmp/ipykernel_10208/597700702.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  flights_comb.carrier[mask] = "Other"

UA       58665
B6       54635
EV       54173
DL       48110
AA       32729
MQ       26397
US       20536
9E       18460
WN       12275
VX        5162
FL        3260
Other     2374
Name: carrier, dtype: int64

In [3]:

# CHUNK 72: Converting Boolean to integer

# Convert Boolean to integer
security = pd.DataFrame({"Camera":["Lobby","Main Floor","Back Door","Front Door","Offices"],"Total Hours Recorded":[51,59,-1,22,27],"Incidents":[2,1,0,0,np.nan]})
display(security.iloc[:,1] > 30) # To create a Boolean variable for this example
(security.iloc[:,1] > 30) * 1 # To convert it to 0 and 1

0     True
1     True
2    False
3    False
4    False
Name: Total Hours Recorded, dtype: bool

0    1
1    1
2    0
3    0
4    0
Name: Total Hours Recorded, dtype: int64

In [4]:
# CHUNK 73: Making a factor variable numeric

my_factor = pd.Series([15,5,10,15,15,15,10], dtype="category")
pd.Series(my_factor,dtype="int")

0    15
1     5
2    10
3    15
4    15
5    15
6    10
dtype: int64

In [38]:
auto.groupby('body_style').agg({'price':'count'})
levels_to_keep = ["sedan", "hatchback"]
mask = auto.body_style.isin(levels_to_keep)
auto.body_style[-levels_to_keep] = "Other"

# auto.groupby('body_style').agg({'price':'count'})

3      True
4      True
6      True
8      True
10     True
       ...
200    True
201    True
202    True
203    True
204    True
Name: body_style, Length: 159, dtype: bool

In [39]:
# CHUNK 74: Exercise 2.3.14

Auto_Names = ["symboling", "normalized_losses", "make", "fuel_type","aspiration", "num_doors", "body_style", "drive_wheels","engine_location", "wheel_base", "length", "width", "height", "curb_weight", "engine_type","num_cylinders", "engine_size", "fuel_system", "bore", "stroke", "compression_ratio", "horsepower", "peak_rpm", "city_mpg", "highway_mpg", "price"]

import pandas as pd
auto = pd.read_csv("Data/automobile.csv",names = Auto_Names)
cols_w_QMark = auto.apply(lambda col: col.eq("?").sum() > 0, axis=0)
cols_w_QMark['num_doors'] = False

# 1 Replace those “?” values with NAs
auto = auto.replace("?", np.nan)

# 2 Remove all records with missing values
auto = auto.dropna()

# 3 Rename the variable drive_wheels to drive_type
auto = auto.rename(columns = {'drive_wheels':'drive_type'})

# 4 Recode all the variables in the new variable drive_type. Make “rwd” into “rear”, “fwd” into “front”, and “4wd” into “four”
auto.drive_type = auto.drive_type.map({'rwd':'rear', 'fwd':'front', '4wd':'four'})

# 5 Change the values in the variable engine_location so that only the first two letters show and make those two letters all uppercase
auto.engine_location = auto.engine_location.str.upper().str[:2]

# 6 There are some numeric columns that had “?”, and as a result, they were marked as strings or characters. Convert those variables to numeric
auto_num = auto.iloc[:, cols_w_QMark.array].apply(pd.to_numeric)
auto = auto.assign(normalized_losses = auto_num.normalized_losses,
                    bore = auto_num.bore,
                    stroke = auto_num.stroke,
                    horsepower = auto_num.horsepower,
                    peak_rpm = auto_num.peak_rpm,
                    price = auto_num.price)

# 7 Combine factors in the body_style variable so that there are only three factors: “sedan”, “hatchback”, and “Other”
auto.groupby('body_style').agg({'price':'count'})
levels_to_keep = ["sedan", "hatchback"]
mask = auto.body_style.isin(levels_to_keep)
auto.body_style[-mask] = "Other"


print("Number of Rows in auto:", auto.shape[0])
display(auto)

Number of Rows in auto: 159

/tmp/ipykernel_11567/94652107.py:38: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  auto.body_style[-mask] = "Other"

,symboling,normalized_losses,make,fuel_type,aspiration,num_doors,body_style,drive_type,engine_location,wheel_base,...,engine_size,fuel_system,bore,stroke,compression_ratio,horsepower,peak_rpm,city_mpg,highway_mpg,price
3,2,164,audi,gas,std,four,sedan,front,FR,99.8,...,109,mpfi,3.19,3.40,10.0,102,5500,24,30,13950
4,2,164,audi,gas,std,four,sedan,four,FR,99.4,...,136,mpfi,3.19,3.40,8.0,115,5500,18,22,17450
6,1,158,audi,gas,std,four,sedan,front,FR,105.8,...,136,mpfi,3.19,3.40,8.5,110,5500,19,25,17710
8,1,158,audi,gas,turbo,four,sedan,front,FR,105.8,...,131,mpfi,3.13,3.40,8.3,140,5500,17,20,23875
10,2,192,bmw,gas,std,two,sedan,rear,FR,101.2,...,108,mpfi,3.50,2.80,8.8,101,5800,23,29,16430
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
200,-1,95,volvo,gas,std,four,sedan,rear,FR,109.1,...,141,mpfi,3.78,3.15,9.5,114,5400,23,28,16845
201,-1,95,volvo,gas,turbo,four,sedan,rear,FR,109.1,...,141,mpfi,3.78,3.15,8.7,160,5300,19,25,19045
202,-1,95,volvo,gas,std,four,sedan,rear,FR,109.1,...,173,mpfi,3.58,2.87,8.8,134,5500,18,23,21485
203,-1,95,volvo,diesel,turbo,four,sedan,rear,FR,109.1,...,145,idi,3.01,3.40,23.0,106,4800,26,27,22470
204,-1,95,volvo,gas,turbo,four,sedan,rear,FR,109.1,...,141,mpfi,3.78,3.15,9.5,114,5400,19,25,22625

In [36]:

# # CHUNK 75: Exercise 2.3.14: Solution

Auto_Names = ["symboling", "normalized_losses", "make", "fuel_type","aspiration", "num_doors", "body_style", "drive_wheels","engine_location", "wheel_base", "length", "width", "height", "curb_weight", "engine_type","num_cylinders", "engine_size", "fuel_system", "bore", "stroke", "compression_ratio", "horsepower", "peak_rpm", "city_mpg", "highway_mpg", "price"]

import pandas as pd
auto = pd.read_csv("Data/automobile.csv",names = Auto_Names)

# 1 Use the principles of data manipulation to replace those “?” values with NAs
auto = auto.replace("?",np.nan)

# 2 Remove all records with missing values
auto = auto.dropna()

# 3 Rename the variable drive_wheels to drive_type. 
auto = auto.rename(columns={"drive_wheels":"drive_type"})

# 4 Recode all the variables in the new variable drive_type. Make “rwd” into “rear”, “fwd” into “front”, and “4wd” into “four”. 
auto["drive_type"] =  auto["drive_type"].map({"rwd":"rear","fwd":"front","4wd":"four"})

# 5 Change the values in the variable engine_location  so that only the first two letters show and make those two letters all uppercase. 
auto = auto.assign(engine_location=auto.engine_location.str.upper().str[0:2])

# 6 There are some numeric columns that have “?”, and as a result, they were marked as strings or characters. Convert those variables to numeric. 
auto = auto.assign(normalized_losses = [float(x) for x in auto.normalized_losses],stroke = [float(x) for x in auto.stroke],bore = [float(x) for x in auto.bore],price = [float(x) for x in auto.price])

# 7 Combine factors in the body_style variable so that there are only three factors: “sedan”, “hatchback”, and “Other”
big_levels = ["sedan","hatchback"]
mask = auto.body_style.isin(big_levels)
auto.body_style[-mask] = "Other"

# pd.set_option('max_columns', None) # This will display all the columns
auto

/tmp/ipykernel_11567/2324714943.py:29: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  auto.body_style[-mask] = "Other"

,symboling,normalized_losses,make,fuel_type,aspiration,num_doors,body_style,drive_type,engine_location,wheel_base,...,engine_size,fuel_system,bore,stroke,compression_ratio,horsepower,peak_rpm,city_mpg,highway_mpg,price
3,2,164.0,audi,gas,std,four,sedan,front,FR,99.8,...,109,mpfi,3.19,3.40,10.0,102,5500,24,30,13950.0
4,2,164.0,audi,gas,std,four,sedan,four,FR,99.4,...,136,mpfi,3.19,3.40,8.0,115,5500,18,22,17450.0
6,1,158.0,audi,gas,std,four,sedan,front,FR,105.8,...,136,mpfi,3.19,3.40,8.5,110,5500,19,25,17710.0
8,1,158.0,audi,gas,turbo,four,sedan,front,FR,105.8,...,131,mpfi,3.13,3.40,8.3,140,5500,17,20,23875.0
10,2,192.0,bmw,gas,std,two,sedan,rear,FR,101.2,...,108,mpfi,3.50,2.80,8.8,101,5800,23,29,16430.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
200,-1,95.0,volvo,gas,std,four,sedan,rear,FR,109.1,...,141,mpfi,3.78,3.15,9.5,114,5400,23,28,16845.0
201,-1,95.0,volvo,gas,turbo,four,sedan,rear,FR,109.1,...,141,mpfi,3.78,3.15,8.7,160,5300,19,25,19045.0
202,-1,95.0,volvo,gas,std,four,sedan,rear,FR,109.1,...,173,mpfi,3.58,2.87,8.8,134,5500,18,23,21485.0
203,-1,95.0,volvo,diesel,turbo,four,sedan,rear,FR,109.1,...,145,idi,3.01,3.40,23.0,106,4800,26,27,22470.0
204,-1,95.0,volvo,gas,turbo,four,sedan,rear,FR,109.1,...,141,mpfi,3.78,3.15,9.5,114,5400,19,25,22625.0